Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxDma_reg.h
/** \brief 18F4, DMA Channel 61 Resource Partition Register */
#define DMA_HRR61 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_HRR*)0xF00118F4u)
/** Alias (User Manual Name) for DMA_HRR61.
* To use register names with standard convension, please use DMA_HRR61.
*/
#define DMA_HRR061 (DMA_HRR61)

/** \brief 18F8, DMA Channel 62 Resource Partition Register */
#define DMA_HRR62 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_HRR*)0xF00118F8u)
/** Alias (User Manual Name) for DMA_HRR62.
* To use register names with standard convension, please use DMA_HRR62.
*/
#define DMA_HRR062 (DMA_HRR62)

/** \brief 18FC, DMA Channel 63 Resource Partition Register */
#define DMA_HRR63 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_HRR*)0xF00118FCu)
/** Alias (User Manual Name) for DMA_HRR63.
* To use register names with standard convension, please use DMA_HRR63.
*/
#define DMA_HRR063 (DMA_HRR63)

/** \brief 1900, DMA Channel 64 Resource Partition Register */
#define DMA_HRR64 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_HRR*)0xF0011900u)
/** Alias (User Manual Name) for DMA_HRR64.
* To use register names with standard convension, please use DMA_HRR64.
*/
#define DMA_HRR064 (DMA_HRR64)

/** \brief 1904, DMA Channel 65 Resource Partition Register */
#define DMA_HRR65 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_HRR*)0xF0011904u)
/** Alias (User Manual Name) for DMA_HRR65.
* To use register names with standard convension, please use DMA_HRR65.
*/
#define DMA_HRR065 (DMA_HRR65)

/** \brief 1908, DMA Channel 66 Resource Partition Register */
#define DMA_HRR66 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_HRR*)0xF0011908u)
/** Alias (User Manual Name) for DMA_HRR66.
* To use register names with standard convension, please use DMA_HRR66.
*/
#define DMA_HRR066 (DMA_HRR66)

/** \brief 190C, DMA Channel 67 Resource Partition Register */
#define DMA_HRR67 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_HRR*)0xF001190Cu)
/** Alias (User Manual Name) for DMA_HRR67.
* To use register names with standard convension, please use DMA_HRR67.
*/
#define DMA_HRR067 (DMA_HRR67)

/** \brief 1910, DMA Channel 68 Resource Partition Register */
#define DMA_HRR68 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_HRR*)0xF0011910u)
/** Alias (User Manual Name) for DMA_HRR68.
* To use register names with standard convension, please use DMA_HRR68.
*/
#define DMA_HRR068 (DMA_HRR68)

/** \brief 1914, DMA Channel 69 Resource Partition Register */
#define DMA_HRR69 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_HRR*)0xF0011914u)
/** Alias (User Manual Name) for DMA_HRR69.
* To use register names with standard convension, please use DMA_HRR69.
*/
#define DMA_HRR069 (DMA_HRR69)

/** \brief 1918, DMA Channel 70 Resource Partition Register */
#define DMA_HRR70 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_HRR*)0xF0011918u)
/** Alias (User Manual Name) for DMA_HRR70.
* To use register names with standard convension, please use DMA_HRR70.
*/
#define DMA_HRR070 (DMA_HRR70)

/** \brief 191C, DMA Channel 71 Resource Partition Register */
#define DMA_HRR71 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_HRR*)0xF001191Cu)
/** Alias (User Manual Name) for DMA_HRR71.
* To use register names with standard convension, please use DMA_HRR71.
*/
#define DMA_HRR071 (DMA_HRR71)

/** \brief 1920, DMA Channel 72 Resource Partition Register */
#define DMA_HRR72 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_HRR*)0xF0011920u)
/** Alias (User Manual Name) for DMA_HRR72.
* To use register names with standard convension, please use DMA_HRR72.
*/
#define DMA_HRR072 (DMA_HRR72)

/** \brief 1924, DMA Channel 73 Resource Partition Register */
#define DMA_HRR73 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_HRR*)0xF0011924u)
/** Alias (User Manual Name) for DMA_HRR73.
* To use register names with standard convension, please use DMA_HRR73.
*/
#define DMA_HRR073 (DMA_HRR73)

/** \brief 1928, DMA Channel 74 Resource Partition Register */
#define DMA_HRR74 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_HRR*)0xF0011928u)
/** Alias (User Manual Name) for DMA_HRR74.
* To use register names with standard convension, please use DMA_HRR74.
*/
#define DMA_HRR074 (DMA_HRR74)

/** \brief 192C, DMA Channel 75 Resource Partition Register */
#define DMA_HRR75 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_HRR*)0xF001192Cu)
/** Alias (User Manual Name) for DMA_HRR75.
* To use register names with standard convension, please use DMA_HRR75.
*/
#define DMA_HRR075 (DMA_HRR75)

/** \brief 1930, DMA Channel 76 Resource Partition Register */
#define DMA_HRR76 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_HRR*)0xF0011930u)
/** Alias (User Manual Name) for DMA_HRR76.
* To use register names with standard convension, please use DMA_HRR76.
*/
#define DMA_HRR076 (DMA_HRR76)

/** \brief 1934, DMA Channel 77 Resource Partition Register */
#define DMA_HRR77 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_HRR*)0xF0011934u)
/** Alias (User Manual Name) for DMA_HRR77.
* To use register names with standard convension, please use DMA_HRR77.
*/
#define DMA_HRR077 (DMA_HRR77)

/** \brief 1938, DMA Channel 78 Resource Partition Register */
#define DMA_HRR78 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_HRR*)0xF0011938u)
/** Alias (User Manual Name) for DMA_HRR78.
* To use register names with standard convension, please use DMA_HRR78.
*/
#define DMA_HRR078 (DMA_HRR78)

/** \brief 193C, DMA Channel 79 Resource Partition Register */
#define DMA_HRR79 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_HRR*)0xF001193Cu)
/** Alias (User Manual Name) for DMA_HRR79.
* To use register names with standard convension, please use DMA_HRR79.
*/
#define DMA_HRR079 (DMA_HRR79)

/** \brief 1940, DMA Channel 80 Resource Partition Register */
#define DMA_HRR80 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_HRR*)0xF0011940u)
/** Alias (User Manual Name) for DMA_HRR80.
* To use register names with standard convension, please use DMA_HRR80.
*/
#define DMA_HRR080 (DMA_HRR80)

/** \brief 1944, DMA Channel 81 Resource Partition Register */
#define DMA_HRR81 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_HRR*)0xF0011944u)
/** Alias (User Manual Name) for DMA_HRR81.
* To use register names with standard convension, please use DMA_HRR81.
*/
#define DMA_HRR081 (DMA_HRR81)

/** \brief 1948, DMA Channel 82 Resource Partition Register */
#define DMA_HRR82 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_HRR*)0xF0011948u)
/** Alias (User Manual Name) for DMA_HRR82.
* To use register names with standard convension, please use DMA_HRR82.
*/
#define DMA_HRR082 (DMA_HRR82)

/** \brief 194C, DMA Channel 83 Resource Partition Register */
#define DMA_HRR83 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_HRR*)0xF001194Cu)
/** Alias (User Manual Name) for DMA_HRR83.
* To use register names with standard convension, please use DMA_HRR83.
*/
#define DMA_HRR083 (DMA_HRR83)

/** \brief 1950, DMA Channel 84 Resource Partition Register */
#define DMA_HRR84 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_HRR*)0xF0011950u)
/** Alias (User Manual Name) for DMA_HRR84.
* To use register names with standard convension, please use DMA_HRR84.
*/
#define DMA_HRR084 (DMA_HRR84)

/** \brief 1954, DMA Channel 85 Resource Partition Register */
#define DMA_HRR85 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_HRR*)0xF0011954u)
/** Alias (User Manual Name) for DMA_HRR85.
* To use register names with standard convension, please use DMA_HRR85.
*/
#define DMA_HRR085 (DMA_HRR85)

/** \brief 1958, DMA Channel 86 Resource Partition Register */
#define DMA_HRR86 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_HRR*)0xF0011958u)
/** Alias (User Manual Name) for DMA_HRR86.
* To use register names with standard convension, please use DMA_HRR86.
*/
#define DMA_HRR086 (DMA_HRR86)

/** \brief 195C, DMA Channel 87 Resource Partition Register */
#define DMA_HRR87 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_HRR*)0xF001195Cu)
/** Alias (User Manual Name) for DMA_HRR87.
* To use register names with standard convension, please use DMA_HRR87.
*/
#define DMA_HRR087 (DMA_HRR87)

/** \brief 1960, DMA Channel 88 Resource Partition Register */
#define DMA_HRR88 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_HRR*)0xF0011960u)
/** Alias (User Manual Name) for DMA_HRR88.
* To use register names with standard convension, please use DMA_HRR88.
*/
#define DMA_HRR088 (DMA_HRR88)

/** \brief 1964, DMA Channel 89 Resource Partition Register */
#define DMA_HRR89 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_HRR*)0xF0011964u)
/** Alias (User Manual Name) for DMA_HRR89.
* To use register names with standard convension, please use DMA_HRR89.
*/
#define DMA_HRR089 (DMA_HRR89)

/** \brief 1968, DMA Channel 90 Resource Partition Register */
#define DMA_HRR90 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_HRR*)0xF0011968u)
/** Alias (User Manual Name) for DMA_HRR90.
* To use register names with standard convension, please use DMA_HRR90.
*/
#define DMA_HRR090 (DMA_HRR90)

/** \brief 196C, DMA Channel 91 Resource Partition Register */
#define DMA_HRR91 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_HRR*)0xF001196Cu)
/** Alias (User Manual Name) for DMA_HRR91.
* To use register names with standard convension, please use DMA_HRR91.
*/
#define DMA_HRR091 (DMA_HRR91)

