Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxDma_reg.h
/** \brief 1EF0, DMA Channel 60 Transaction State Register */
#define DMA_TSR60 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_TSR*)0xF0011EF0u)
/** Alias (User Manual Name) for DMA_TSR60.
* To use register names with standard convension, please use DMA_TSR60.
*/
#define DMA_TSR060 (DMA_TSR60)

/** \brief 1EF4, DMA Channel 61 Transaction State Register */
#define DMA_TSR61 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_TSR*)0xF0011EF4u)
/** Alias (User Manual Name) for DMA_TSR61.
* To use register names with standard convension, please use DMA_TSR61.
*/
#define DMA_TSR061 (DMA_TSR61)

/** \brief 1EF8, DMA Channel 62 Transaction State Register */
#define DMA_TSR62 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_TSR*)0xF0011EF8u)
/** Alias (User Manual Name) for DMA_TSR62.
* To use register names with standard convension, please use DMA_TSR62.
*/
#define DMA_TSR062 (DMA_TSR62)

/** \brief 1EFC, DMA Channel 63 Transaction State Register */
#define DMA_TSR63 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_TSR*)0xF0011EFCu)
/** Alias (User Manual Name) for DMA_TSR63.
* To use register names with standard convension, please use DMA_TSR63.
*/
#define DMA_TSR063 (DMA_TSR63)

/** \brief 1F00, DMA Channel 64 Transaction State Register */
#define DMA_TSR64 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F00u)
/** Alias (User Manual Name) for DMA_TSR64.
* To use register names with standard convension, please use DMA_TSR64.
*/
#define DMA_TSR064 (DMA_TSR64)

/** \brief 1F04, DMA Channel 65 Transaction State Register */
#define DMA_TSR65 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F04u)
/** Alias (User Manual Name) for DMA_TSR65.
* To use register names with standard convension, please use DMA_TSR65.
*/
#define DMA_TSR065 (DMA_TSR65)

/** \brief 1F08, DMA Channel 66 Transaction State Register */
#define DMA_TSR66 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F08u)
/** Alias (User Manual Name) for DMA_TSR66.
* To use register names with standard convension, please use DMA_TSR66.
*/
#define DMA_TSR066 (DMA_TSR66)

/** \brief 1F0C, DMA Channel 67 Transaction State Register */
#define DMA_TSR67 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F0Cu)
/** Alias (User Manual Name) for DMA_TSR67.
* To use register names with standard convension, please use DMA_TSR67.
*/
#define DMA_TSR067 (DMA_TSR67)

/** \brief 1F10, DMA Channel 68 Transaction State Register */
#define DMA_TSR68 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F10u)
/** Alias (User Manual Name) for DMA_TSR68.
* To use register names with standard convension, please use DMA_TSR68.
*/
#define DMA_TSR068 (DMA_TSR68)

/** \brief 1F14, DMA Channel 69 Transaction State Register */
#define DMA_TSR69 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F14u)
/** Alias (User Manual Name) for DMA_TSR69.
* To use register names with standard convension, please use DMA_TSR69.
*/
#define DMA_TSR069 (DMA_TSR69)

/** \brief 1F18, DMA Channel 70 Transaction State Register */
#define DMA_TSR70 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F18u)
/** Alias (User Manual Name) for DMA_TSR70.
* To use register names with standard convension, please use DMA_TSR70.
*/
#define DMA_TSR070 (DMA_TSR70)

/** \brief 1F1C, DMA Channel 71 Transaction State Register */
#define DMA_TSR71 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F1Cu)
/** Alias (User Manual Name) for DMA_TSR71.
* To use register names with standard convension, please use DMA_TSR71.
*/
#define DMA_TSR071 (DMA_TSR71)

/** \brief 1F20, DMA Channel 72 Transaction State Register */
#define DMA_TSR72 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F20u)
/** Alias (User Manual Name) for DMA_TSR72.
* To use register names with standard convension, please use DMA_TSR72.
*/
#define DMA_TSR072 (DMA_TSR72)

/** \brief 1F24, DMA Channel 73 Transaction State Register */
#define DMA_TSR73 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F24u)
/** Alias (User Manual Name) for DMA_TSR73.
* To use register names with standard convension, please use DMA_TSR73.
*/
#define DMA_TSR073 (DMA_TSR73)

/** \brief 1F28, DMA Channel 74 Transaction State Register */
#define DMA_TSR74 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F28u)
/** Alias (User Manual Name) for DMA_TSR74.
* To use register names with standard convension, please use DMA_TSR74.
*/
#define DMA_TSR074 (DMA_TSR74)

/** \brief 1F2C, DMA Channel 75 Transaction State Register */
#define DMA_TSR75 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F2Cu)
/** Alias (User Manual Name) for DMA_TSR75.
* To use register names with standard convension, please use DMA_TSR75.
*/
#define DMA_TSR075 (DMA_TSR75)

/** \brief 1F30, DMA Channel 76 Transaction State Register */
#define DMA_TSR76 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F30u)
/** Alias (User Manual Name) for DMA_TSR76.
* To use register names with standard convension, please use DMA_TSR76.
*/
#define DMA_TSR076 (DMA_TSR76)

/** \brief 1F34, DMA Channel 77 Transaction State Register */
#define DMA_TSR77 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F34u)
/** Alias (User Manual Name) for DMA_TSR77.
* To use register names with standard convension, please use DMA_TSR77.
*/
#define DMA_TSR077 (DMA_TSR77)

/** \brief 1F38, DMA Channel 78 Transaction State Register */
#define DMA_TSR78 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F38u)
/** Alias (User Manual Name) for DMA_TSR78.
* To use register names with standard convension, please use DMA_TSR78.
*/
#define DMA_TSR078 (DMA_TSR78)

/** \brief 1F3C, DMA Channel 79 Transaction State Register */
#define DMA_TSR79 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F3Cu)
/** Alias (User Manual Name) for DMA_TSR79.
* To use register names with standard convension, please use DMA_TSR79.
*/
#define DMA_TSR079 (DMA_TSR79)

/** \brief 1F40, DMA Channel 80 Transaction State Register */
#define DMA_TSR80 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_TSR*)0xF0011F40u)
/** Alias (User Manual Name) for DMA_TSR80.
* To use register names with standard convension, please use DMA_TSR80.
*/
#define DMA_TSR080 (DMA_TSR80)

