Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxDma_reg.h
/** \brief 29B8, DMARAM Channel 77 Shadow Address Register */
#define DMA_CH77_SHADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF00129B8u)
/** Alias (User Manual Name) for DMA_CH77_SHADR.
* To use register names with standard convension, please use DMA_CH77_SHADR.
*/
#define DMA_SHADR077 (DMA_CH77_SHADR)

/** \brief 29BC, DMARAM Channel 77 Control and Status Register */
#define DMA_CH77_CHCSR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF00129BCu)
/** Alias (User Manual Name) for DMA_CH77_CHCSR.
* To use register names with standard convension, please use DMA_CH77_CHCSR.
*/
#define DMA_CHCSR077 (DMA_CH77_CHCSR)

/** \brief 29C0, DMARAM Channel 78 Read Data CRC Register */
#define DMA_CH78_RDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF00129C0u)
/** Alias (User Manual Name) for DMA_CH78_RDCRCR.
* To use register names with standard convension, please use DMA_CH78_RDCRCR.
*/
#define DMA_RDCRCR078 (DMA_CH78_RDCRCR)

/** \brief 29C4, DMARAM Channel 78 Source and Destination Address CRC Register */
#define DMA_CH78_SDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF00129C4u)
/** Alias (User Manual Name) for DMA_CH78_SDCRCR.
* To use register names with standard convension, please use DMA_CH78_SDCRCR.
*/
#define DMA_SDCRCR078 (DMA_CH78_SDCRCR)

/** \brief 29C8, DMARAM Channel 78 Source Address Register */
#define DMA_CH78_SADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF00129C8u)
/** Alias (User Manual Name) for DMA_CH78_SADR.
* To use register names with standard convension, please use DMA_CH78_SADR.
*/
#define DMA_SADR078 (DMA_CH78_SADR)

/** \brief 29CC, DMARAM Channel 78 Destination Address Register */
#define DMA_CH78_DADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF00129CCu)
/** Alias (User Manual Name) for DMA_CH78_DADR.
* To use register names with standard convension, please use DMA_CH78_DADR.
*/
#define DMA_DADR078 (DMA_CH78_DADR)

/** \brief 29D0, DMARAM Channel 78 Address and Interrupt Control Register */
#define DMA_CH78_ADICR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF00129D0u)
/** Alias (User Manual Name) for DMA_CH78_ADICR.
* To use register names with standard convension, please use DMA_CH78_ADICR.
*/
#define DMA_ADICR078 (DMA_CH78_ADICR)

/** \brief 29D4, DMARAM Channel 78 Configuration Register */
#define DMA_CH78_CHCFGR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF00129D4u)
/** Alias (User Manual Name) for DMA_CH78_CHCFGR.
* To use register names with standard convension, please use DMA_CH78_CHCFGR.
*/
#define DMA_CHCFGR078 (DMA_CH78_CHCFGR)

/** \brief 29D8, DMARAM Channel 78 Shadow Address Register */
#define DMA_CH78_SHADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF00129D8u)
/** Alias (User Manual Name) for DMA_CH78_SHADR.
* To use register names with standard convension, please use DMA_CH78_SHADR.
*/
#define DMA_SHADR078 (DMA_CH78_SHADR)

/** \brief 29DC, DMARAM Channel 78 Control and Status Register */
#define DMA_CH78_CHCSR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF00129DCu)
/** Alias (User Manual Name) for DMA_CH78_CHCSR.
* To use register names with standard convension, please use DMA_CH78_CHCSR.
*/
#define DMA_CHCSR078 (DMA_CH78_CHCSR)

/** \brief 29E0, DMARAM Channel 79 Read Data CRC Register */
#define DMA_CH79_RDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF00129E0u)
/** Alias (User Manual Name) for DMA_CH79_RDCRCR.
* To use register names with standard convension, please use DMA_CH79_RDCRCR.
*/
#define DMA_RDCRCR079 (DMA_CH79_RDCRCR)

/** \brief 29E4, DMARAM Channel 79 Source and Destination Address CRC Register */
#define DMA_CH79_SDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF00129E4u)
/** Alias (User Manual Name) for DMA_CH79_SDCRCR.
* To use register names with standard convension, please use DMA_CH79_SDCRCR.
*/
#define DMA_SDCRCR079 (DMA_CH79_SDCRCR)

/** \brief 29E8, DMARAM Channel 79 Source Address Register */
#define DMA_CH79_SADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF00129E8u)
/** Alias (User Manual Name) for DMA_CH79_SADR.
* To use register names with standard convension, please use DMA_CH79_SADR.
*/
#define DMA_SADR079 (DMA_CH79_SADR)

/** \brief 29EC, DMARAM Channel 79 Destination Address Register */
#define DMA_CH79_DADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF00129ECu)
/** Alias (User Manual Name) for DMA_CH79_DADR.
* To use register names with standard convension, please use DMA_CH79_DADR.
*/
#define DMA_DADR079 (DMA_CH79_DADR)

/** \brief 29F0, DMARAM Channel 79 Address and Interrupt Control Register */
#define DMA_CH79_ADICR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF00129F0u)
/** Alias (User Manual Name) for DMA_CH79_ADICR.
* To use register names with standard convension, please use DMA_CH79_ADICR.
*/
#define DMA_ADICR079 (DMA_CH79_ADICR)

/** \brief 29F4, DMARAM Channel 79 Configuration Register */
#define DMA_CH79_CHCFGR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF00129F4u)
/** Alias (User Manual Name) for DMA_CH79_CHCFGR.
* To use register names with standard convension, please use DMA_CH79_CHCFGR.
*/
#define DMA_CHCFGR079 (DMA_CH79_CHCFGR)

/** \brief 29F8, DMARAM Channel 79 Shadow Address Register */
#define DMA_CH79_SHADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF00129F8u)
/** Alias (User Manual Name) for DMA_CH79_SHADR.
* To use register names with standard convension, please use DMA_CH79_SHADR.
*/
#define DMA_SHADR079 (DMA_CH79_SHADR)

/** \brief 29FC, DMARAM Channel 79 Control and Status Register */
#define DMA_CH79_CHCSR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF00129FCu)
/** Alias (User Manual Name) for DMA_CH79_CHCSR.
* To use register names with standard convension, please use DMA_CH79_CHCSR.
*/
#define DMA_CHCSR079 (DMA_CH79_CHCSR)

/** \brief 2A00, DMARAM Channel 80 Read Data CRC Register */
#define DMA_CH80_RDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012A00u)
/** Alias (User Manual Name) for DMA_CH80_RDCRCR.
* To use register names with standard convension, please use DMA_CH80_RDCRCR.
*/
#define DMA_RDCRCR080 (DMA_CH80_RDCRCR)

/** \brief 2A04, DMARAM Channel 80 Source and Destination Address CRC Register */
#define DMA_CH80_SDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012A04u)
/** Alias (User Manual Name) for DMA_CH80_SDCRCR.
* To use register names with standard convension, please use DMA_CH80_SDCRCR.
*/
#define DMA_SDCRCR080 (DMA_CH80_SDCRCR)

/** \brief 2A08, DMARAM Channel 80 Source Address Register */
#define DMA_CH80_SADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012A08u)
/** Alias (User Manual Name) for DMA_CH80_SADR.
* To use register names with standard convension, please use DMA_CH80_SADR.
*/
#define DMA_SADR080 (DMA_CH80_SADR)

