Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxDma_reg.h
/** \brief 2C30, DMARAM Channel 97 Address and Interrupt Control Register */
#define DMA_CH97_ADICR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012C30u)
/** Alias (User Manual Name) for DMA_CH97_ADICR.
* To use register names with standard convension, please use DMA_CH97_ADICR.
*/
#define DMA_ADICR097 (DMA_CH97_ADICR)

/** \brief 2C34, DMARAM Channel 97 Configuration Register */
#define DMA_CH97_CHCFGR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012C34u)
/** Alias (User Manual Name) for DMA_CH97_CHCFGR.
* To use register names with standard convension, please use DMA_CH97_CHCFGR.
*/
#define DMA_CHCFGR097 (DMA_CH97_CHCFGR)

/** \brief 2C38, DMARAM Channel 97 Shadow Address Register */
#define DMA_CH97_SHADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012C38u)
/** Alias (User Manual Name) for DMA_CH97_SHADR.
* To use register names with standard convension, please use DMA_CH97_SHADR.
*/
#define DMA_SHADR097 (DMA_CH97_SHADR)

/** \brief 2C3C, DMARAM Channel 97 Control and Status Register */
#define DMA_CH97_CHCSR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012C3Cu)
/** Alias (User Manual Name) for DMA_CH97_CHCSR.
* To use register names with standard convension, please use DMA_CH97_CHCSR.
*/
#define DMA_CHCSR097 (DMA_CH97_CHCSR)

/** \brief 2C40, DMARAM Channel 98 Read Data CRC Register */
#define DMA_CH98_RDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012C40u)
/** Alias (User Manual Name) for DMA_CH98_RDCRCR.
* To use register names with standard convension, please use DMA_CH98_RDCRCR.
*/
#define DMA_RDCRCR098 (DMA_CH98_RDCRCR)

/** \brief 2C44, DMARAM Channel 98 Source and Destination Address CRC Register */
#define DMA_CH98_SDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012C44u)
/** Alias (User Manual Name) for DMA_CH98_SDCRCR.
* To use register names with standard convension, please use DMA_CH98_SDCRCR.
*/
#define DMA_SDCRCR098 (DMA_CH98_SDCRCR)

/** \brief 2C48, DMARAM Channel 98 Source Address Register */
#define DMA_CH98_SADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012C48u)
/** Alias (User Manual Name) for DMA_CH98_SADR.
* To use register names with standard convension, please use DMA_CH98_SADR.
*/
#define DMA_SADR098 (DMA_CH98_SADR)

/** \brief 2C4C, DMARAM Channel 98 Destination Address Register */
#define DMA_CH98_DADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012C4Cu)
/** Alias (User Manual Name) for DMA_CH98_DADR.
* To use register names with standard convension, please use DMA_CH98_DADR.
*/
#define DMA_DADR098 (DMA_CH98_DADR)

/** \brief 2C50, DMARAM Channel 98 Address and Interrupt Control Register */
#define DMA_CH98_ADICR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012C50u)
/** Alias (User Manual Name) for DMA_CH98_ADICR.
* To use register names with standard convension, please use DMA_CH98_ADICR.
*/
#define DMA_ADICR098 (DMA_CH98_ADICR)

/** \brief 2C54, DMARAM Channel 98 Configuration Register */
#define DMA_CH98_CHCFGR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012C54u)
/** Alias (User Manual Name) for DMA_CH98_CHCFGR.
* To use register names with standard convension, please use DMA_CH98_CHCFGR.
*/
#define DMA_CHCFGR098 (DMA_CH98_CHCFGR)

/** \brief 2C58, DMARAM Channel 98 Shadow Address Register */
#define DMA_CH98_SHADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012C58u)
/** Alias (User Manual Name) for DMA_CH98_SHADR.
* To use register names with standard convension, please use DMA_CH98_SHADR.
*/
#define DMA_SHADR098 (DMA_CH98_SHADR)

/** \brief 2C5C, DMARAM Channel 98 Control and Status Register */
#define DMA_CH98_CHCSR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012C5Cu)
/** Alias (User Manual Name) for DMA_CH98_CHCSR.
* To use register names with standard convension, please use DMA_CH98_CHCSR.
*/
#define DMA_CHCSR098 (DMA_CH98_CHCSR)

/** \brief 2C60, DMARAM Channel 99 Read Data CRC Register */
#define DMA_CH99_RDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012C60u)
/** Alias (User Manual Name) for DMA_CH99_RDCRCR.
* To use register names with standard convension, please use DMA_CH99_RDCRCR.
*/
#define DMA_RDCRCR099 (DMA_CH99_RDCRCR)

/** \brief 2C64, DMARAM Channel 99 Source and Destination Address CRC Register */
#define DMA_CH99_SDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012C64u)
/** Alias (User Manual Name) for DMA_CH99_SDCRCR.
* To use register names with standard convension, please use DMA_CH99_SDCRCR.
*/
#define DMA_SDCRCR099 (DMA_CH99_SDCRCR)

/** \brief 2C68, DMARAM Channel 99 Source Address Register */
#define DMA_CH99_SADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012C68u)
/** Alias (User Manual Name) for DMA_CH99_SADR.
* To use register names with standard convension, please use DMA_CH99_SADR.
*/
#define DMA_SADR099 (DMA_CH99_SADR)

/** \brief 2C6C, DMARAM Channel 99 Destination Address Register */
#define DMA_CH99_DADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012C6Cu)
/** Alias (User Manual Name) for DMA_CH99_DADR.
* To use register names with standard convension, please use DMA_CH99_DADR.
*/
#define DMA_DADR099 (DMA_CH99_DADR)

/** \brief 2C70, DMARAM Channel 99 Address and Interrupt Control Register */
#define DMA_CH99_ADICR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012C70u)
/** Alias (User Manual Name) for DMA_CH99_ADICR.
* To use register names with standard convension, please use DMA_CH99_ADICR.
*/
#define DMA_ADICR099 (DMA_CH99_ADICR)

/** \brief 2C74, DMARAM Channel 99 Configuration Register */
#define DMA_CH99_CHCFGR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012C74u)
/** Alias (User Manual Name) for DMA_CH99_CHCFGR.
* To use register names with standard convension, please use DMA_CH99_CHCFGR.
*/
#define DMA_CHCFGR099 (DMA_CH99_CHCFGR)

/** \brief 2C78, DMARAM Channel 99 Shadow Address Register */
#define DMA_CH99_SHADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012C78u)
/** Alias (User Manual Name) for DMA_CH99_SHADR.
* To use register names with standard convension, please use DMA_CH99_SHADR.
*/
#define DMA_SHADR099 (DMA_CH99_SHADR)

/** \brief 2C7C, DMARAM Channel 99 Control and Status Register */
#define DMA_CH99_CHCSR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012C7Cu)
/** Alias (User Manual Name) for DMA_CH99_CHCSR.
* To use register names with standard convension, please use DMA_CH99_CHCSR.
*/
#define DMA_CHCSR099 (DMA_CH99_CHCSR)

/** \brief 2C80, DMARAM Channel 100 Read Data CRC Register */
#define DMA_CH100_RDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012C80u)
/** Alias (User Manual Name) for DMA_CH100_RDCRCR.
* To use register names with standard convension, please use DMA_CH100_RDCRCR.
*/
#define DMA_RDCRCR100 (DMA_CH100_RDCRCR)

/** \brief 2C84, DMARAM Channel 100 Source and Destination Address CRC Register */
#define DMA_CH100_SDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012C84u)
/** Alias (User Manual Name) for DMA_CH100_SDCRCR.
* To use register names with standard convension, please use DMA_CH100_SDCRCR.
*/
#define DMA_SDCRCR100 (DMA_CH100_SDCRCR)

/** \brief 2C88, DMARAM Channel 100 Source Address Register */
#define DMA_CH100_SADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012C88u)
/** Alias (User Manual Name) for DMA_CH100_SADR.
* To use register names with standard convension, please use DMA_CH100_SADR.
*/
#define DMA_SADR100 (DMA_CH100_SADR)

