Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxDma_reg.h
/** \brief 2F44, DMARAM Channel 122 Source and Destination Address CRC Register */
#define DMA_CH122_SDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012F44u)
/** Alias (User Manual Name) for DMA_CH122_SDCRCR.
* To use register names with standard convension, please use DMA_CH122_SDCRCR.
*/
#define DMA_SDCRCR122 (DMA_CH122_SDCRCR)

/** \brief 2F48, DMARAM Channel 122 Source Address Register */
#define DMA_CH122_SADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012F48u)
/** Alias (User Manual Name) for DMA_CH122_SADR.
* To use register names with standard convension, please use DMA_CH122_SADR.
*/
#define DMA_SADR122 (DMA_CH122_SADR)

/** \brief 2F4C, DMARAM Channel 122 Destination Address Register */
#define DMA_CH122_DADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012F4Cu)
/** Alias (User Manual Name) for DMA_CH122_DADR.
* To use register names with standard convension, please use DMA_CH122_DADR.
*/
#define DMA_DADR122 (DMA_CH122_DADR)

/** \brief 2F50, DMARAM Channel 122 Address and Interrupt Control Register */
#define DMA_CH122_ADICR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012F50u)
/** Alias (User Manual Name) for DMA_CH122_ADICR.
* To use register names with standard convension, please use DMA_CH122_ADICR.
*/
#define DMA_ADICR122 (DMA_CH122_ADICR)

/** \brief 2F54, DMARAM Channel 122 Configuration Register */
#define DMA_CH122_CHCFGR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012F54u)
/** Alias (User Manual Name) for DMA_CH122_CHCFGR.
* To use register names with standard convension, please use DMA_CH122_CHCFGR.
*/
#define DMA_CHCFGR122 (DMA_CH122_CHCFGR)

/** \brief 2F58, DMARAM Channel 122 Shadow Address Register */
#define DMA_CH122_SHADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012F58u)
/** Alias (User Manual Name) for DMA_CH122_SHADR.
* To use register names with standard convension, please use DMA_CH122_SHADR.
*/
#define DMA_SHADR122 (DMA_CH122_SHADR)

/** \brief 2F5C, DMARAM Channel 122 Control and Status Register */
#define DMA_CH122_CHCSR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012F5Cu)
/** Alias (User Manual Name) for DMA_CH122_CHCSR.
* To use register names with standard convension, please use DMA_CH122_CHCSR.
*/
#define DMA_CHCSR122 (DMA_CH122_CHCSR)

/** \brief 2F60, DMARAM Channel 123 Read Data CRC Register */
#define DMA_CH123_RDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012F60u)
/** Alias (User Manual Name) for DMA_CH123_RDCRCR.
* To use register names with standard convension, please use DMA_CH123_RDCRCR.
*/
#define DMA_RDCRCR123 (DMA_CH123_RDCRCR)

/** \brief 2F64, DMARAM Channel 123 Source and Destination Address CRC Register */
#define DMA_CH123_SDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012F64u)
/** Alias (User Manual Name) for DMA_CH123_SDCRCR.
* To use register names with standard convension, please use DMA_CH123_SDCRCR.
*/
#define DMA_SDCRCR123 (DMA_CH123_SDCRCR)

/** \brief 2F68, DMARAM Channel 123 Source Address Register */
#define DMA_CH123_SADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012F68u)
/** Alias (User Manual Name) for DMA_CH123_SADR.
* To use register names with standard convension, please use DMA_CH123_SADR.
*/
#define DMA_SADR123 (DMA_CH123_SADR)

/** \brief 2F6C, DMARAM Channel 123 Destination Address Register */
#define DMA_CH123_DADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012F6Cu)
/** Alias (User Manual Name) for DMA_CH123_DADR.
* To use register names with standard convension, please use DMA_CH123_DADR.
*/
#define DMA_DADR123 (DMA_CH123_DADR)

/** \brief 2F70, DMARAM Channel 123 Address and Interrupt Control Register */
#define DMA_CH123_ADICR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012F70u)
/** Alias (User Manual Name) for DMA_CH123_ADICR.
* To use register names with standard convension, please use DMA_CH123_ADICR.
*/
#define DMA_ADICR123 (DMA_CH123_ADICR)

/** \brief 2F74, DMARAM Channel 123 Configuration Register */
#define DMA_CH123_CHCFGR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012F74u)
/** Alias (User Manual Name) for DMA_CH123_CHCFGR.
* To use register names with standard convension, please use DMA_CH123_CHCFGR.
*/
#define DMA_CHCFGR123 (DMA_CH123_CHCFGR)

/** \brief 2F78, DMARAM Channel 123 Shadow Address Register */
#define DMA_CH123_SHADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012F78u)
/** Alias (User Manual Name) for DMA_CH123_SHADR.
* To use register names with standard convension, please use DMA_CH123_SHADR.
*/
#define DMA_SHADR123 (DMA_CH123_SHADR)

/** \brief 2F7C, DMARAM Channel 123 Control and Status Register */
#define DMA_CH123_CHCSR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012F7Cu)
/** Alias (User Manual Name) for DMA_CH123_CHCSR.
* To use register names with standard convension, please use DMA_CH123_CHCSR.
*/
#define DMA_CHCSR123 (DMA_CH123_CHCSR)

/** \brief 2F80, DMARAM Channel 124 Read Data CRC Register */
#define DMA_CH124_RDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012F80u)
/** Alias (User Manual Name) for DMA_CH124_RDCRCR.
* To use register names with standard convension, please use DMA_CH124_RDCRCR.
*/
#define DMA_RDCRCR124 (DMA_CH124_RDCRCR)

/** \brief 2F84, DMARAM Channel 124 Source and Destination Address CRC Register */
#define DMA_CH124_SDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012F84u)
/** Alias (User Manual Name) for DMA_CH124_SDCRCR.
* To use register names with standard convension, please use DMA_CH124_SDCRCR.
*/
#define DMA_SDCRCR124 (DMA_CH124_SDCRCR)

/** \brief 2F88, DMARAM Channel 124 Source Address Register */
#define DMA_CH124_SADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012F88u)
/** Alias (User Manual Name) for DMA_CH124_SADR.
* To use register names with standard convension, please use DMA_CH124_SADR.
*/
#define DMA_SADR124 (DMA_CH124_SADR)

/** \brief 2F8C, DMARAM Channel 124 Destination Address Register */
#define DMA_CH124_DADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012F8Cu)
/** Alias (User Manual Name) for DMA_CH124_DADR.
* To use register names with standard convension, please use DMA_CH124_DADR.
*/
#define DMA_DADR124 (DMA_CH124_DADR)

/** \brief 2F90, DMARAM Channel 124 Address and Interrupt Control Register */
#define DMA_CH124_ADICR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012F90u)
/** Alias (User Manual Name) for DMA_CH124_ADICR.
* To use register names with standard convension, please use DMA_CH124_ADICR.
*/
#define DMA_ADICR124 (DMA_CH124_ADICR)

/** \brief 2F94, DMARAM Channel 124 Configuration Register */
#define DMA_CH124_CHCFGR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012F94u)
/** Alias (User Manual Name) for DMA_CH124_CHCFGR.
* To use register names with standard convension, please use DMA_CH124_CHCFGR.
*/
#define DMA_CHCFGR124 (DMA_CH124_CHCFGR)

/** \brief 2F98, DMARAM Channel 124 Shadow Address Register */
#define DMA_CH124_SHADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012F98u)
/** Alias (User Manual Name) for DMA_CH124_SHADR.
* To use register names with standard convension, please use DMA_CH124_SHADR.
*/
#define DMA_SHADR124 (DMA_CH124_SHADR)

/** \brief 2F9C, DMARAM Channel 124 Control and Status Register */
#define DMA_CH124_CHCSR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012F9Cu)
/** Alias (User Manual Name) for DMA_CH124_CHCSR.
* To use register names with standard convension, please use DMA_CH124_CHCSR.
*/
#define DMA_CHCSR124 (DMA_CH124_CHCSR)

/** \brief 2FA0, DMARAM Channel 125 Read Data CRC Register */
#define DMA_CH125_RDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012FA0u)
/** Alias (User Manual Name) for DMA_CH125_RDCRCR.
* To use register names with standard convension, please use DMA_CH125_RDCRCR.
*/
#define DMA_RDCRCR125 (DMA_CH125_RDCRCR)

